[ {
  "id": 3,
  "date": "9/2021 - 1/2022",
  "company": "Unleashed Technologies",
  "title": "Frontend React Developer - Contract - Remote",
  "description": "Landed my first real web developer position. Just a short contract role that was over too soon. But it was fun, I learned a lot, and I'm ready for whatever's next.",
  "bullets": {
    "heading": "Current Job Stats",
    "points": [
      "As part of an Agile front-end team, I worked closely with clients and the back end team, participating in daily standups/scrum meetings to help define deliverables and report on progress.",
      "Programmed React components and Cypress tests in a huge eCommerce app.",
      "Worked on assigned Jira tickets to complete bug fixes, code reviews and new features."
    ]
  }
},
  {
    "id": 2,
    "date": "2/2017 - 6/2021",
    "company": "Treehouse",
    "title": "Front-end and Full Stack JavaScript Developer and Student Success Specialist - W2 - Remote",
    "description": "Promoted from contract to part time, then to full time, and from front end to the illustrious Full Stack JavaScript Techdegree.",
    "bullets": {
      "heading": "Current Job Stats",
      "points": [
        "Equal parts developer, mentor, and customer support specialist, I oversaw the Front-end and Full Stack JavaScript Techdegrees (online web dev bootcamps).",
        "Helped write and review relevant software and instructional material, including educational websites and apps that I programmed, styled and debugged.",
        "Evaluated 4,600+ student projects and mentored hundreds of students through learning, programming, debugging, impostor syndrome and the job search.", 
        "Created, curated and documented team processes."
      ]
    }
  },
  {
    "id": 1,
    "date": "3/2016 - 2/2017",
    "company": "Treehouse",
    "title": "Contractor — Web Development Student Mentor",
    "description": "Got my first web dev gig.",
    "bullets": {
      "heading": "Duties",
      "points": [
        "Review, evaluate and grade student code and project submissions.", 
        "Live debugging and mentoring in Slack support community."
      ]
    } 
  },
  {
    "id": 0,
    "date": "6/2014",
    "company": "Student",
    "title": "Discovered that I could learn to code",
    "description": "Began studying front end web development and design. Signed up for Treehouse, Codecademy and Udacity.  Fell in love with programming."
  }
]
