[
  {
    "date": "4/27/2021",
    "name": "Seth L ",
    "role": "Student",
    "prop": "Thank you @robertpm for putting up with my \"agh I'm gonna die in 2 seconds if I don't figure this out\" moments (especially Units 2 and 7!). You are a consummate professional."
  },
  {
    "date": "3/2/2021",
    "name": "Ryan W ",
    "role": "Student",
    "prop": "It works!!!!! WOOT! @robertpm you are a steely-eyed JS Dev, thank you!"
  },
  {
    "date": "1/13/2021",
    "name": "Nathan",
    "role": "Student",
    "prop": "Awesome! Thank you again @robertpm! You're always ready help and I really appreciate it!"
  },
  {
    "date": "1/12/2021",
    "name": "Branden M",
    "role": "Student",
    "prop": "Awesome! I really appreciate you taking the time. This made everything run super fast. How’d you do that? haha Using a basic Promise is not something I would have thought of. Kudos"
  },
  {
    "date": "12/18/2020",
    "name": "Andy S",
    "role": "Student",
    "prop": "I think I love you @robertpm I didn't think to add my else statement just assumed the if was wrong."
  },
  {
    "date": "12/16/2020",
    "name": "Josh N",
    "role": "Student",
    "prop": "You had me at “an undulating atmosphere of atoms and molecules.”  Write a book, please?  Thank you for these articulate, empathic and supportive posts. You are greatly appreciated @robertpm!"
  },
  {
    "date": "12/16/2020",
    "name": "Arielle D",
    "role": "Student",
    "prop": "I second @Josh Nussbaum’s sentiments! Your kind words are extremely appreciated, @robertpm. Wishing you all the best this holiday season and beyond."
  },
  {
    "date": "12/1/2020",
    "name": "Kaya J",
    "role": "Student",
    "prop": "Thank you @robertpm. You explained it so well that I have no follow up questions. It works perfectly."
  },
  {
    "date": "11/30/2020",
    "name": "Michael_M",
    "role": "Student",
    "prop": "Thanks for  the review @robertpm - your comments always help me with my impostor syndrome!!!!"
  },
  {
    "date": "11/30/2020",
    "name": "Zachary L",
    "role": "Student",
    "prop": "Oh my gosh, your psuedo-code helped me out so much! THANK YOU SO MUCH!"
  },
  {
    "date": "2/29/2020",
    "name": "Jesus",
    "role": "Student",
    "prop": "Wow! I greatly appreciate this very much! You're awesome thank you!!"
  },
  {
    "date": "2/25/2020",
    "name": "John S",
    "role": "Teammate",
    "prop": "Wow, what a freaking rock star. I love it, and love the story! What a great little thing to add to your future resume, too. I am totally going to check out your done-in-6-hour masterpiece repo. "
  },
  {
    "date": "2/25/2020",
    "name": "Luis m",
    "role": "Student",
    "prop": "Robert, You the Man!!! Thanks again, seriously. You know Robert..Thank You. I needed to read this. Thank you for, not bitting and really responding in a thoughtful, composed way. I appreciate it a lot."
  },
  {
    "date": "2/25/2020",
    "name": "Brian J",
    "role": "Teammate",
    "prop": "@channel Great news everyone! The next level genius @robertpm  has built a backup API for this project! All you need to do to utilize it, is replace the current API URL you are using in your project with this one: https://fsjs-public-api-backup.herokuapp.com/api"
  },
  {
    "date": "2/25/2020",
    "name": "Piotr M",
    "role": "Student",
    "prop": "@robertpm is a hero!!!"
  },
  {
    "date": "1/28/2020",
    "name": "Hunter B",
    "role": "Student",
    "prop": "@robertpm Love the way you care for your flock here, brother. Since day one, your words are always lingering a light in the abyss to help us navigate through our weakest moments. Treehouse knew what was up bringing you on to take the reigns here( or they should). It’s a pleasure learning from you"
  },
  {
    "date": "1/28/2020",
    "name": "Lucas M",
    "role": "Student",
    "prop": "Thank you @robertpm for always sending us such great inspiration and strength in this touch taks of becoming the best developers we can be! I know I don't post here a lot, but I always read all of your messages because they are so worth it, so I just wanted to take the time to thank you again for everything you do for us!"
  },
  {
    "date": "1/28/2020",
    "name": "Lucas M",
    "role": "Student",
    "prop": "@robertpm you've done it again. You're my hero"
  },
  {
    "date": "10/29/2019",
    "name": "Jamie G",
    "role": "Student",
    "prop": "I always love your article posts. I always throw these into my to-read list. Makes me reevaluate my habits"
  },
  {
    "date": "10/28/2019",
    "name": "Lucas M",
    "role": "Student",
    "prop": "@robertpm, you sir, are a saint"
  },
  {
    "date": "9/20/2019",
    "name": "Ewerton L",
    "role": "Student",
    "prop": "oh, I got it!!! Thank you very much, @robertpm! You are truly awesome!"
  },
  {
    "date": "9/12/2019",
    "name": "Jasper K",
    "role": "Student",
    "prop": "What a great explanation! @robertpm  "
  },
  {
    "date": "9/12/2019",
    "name": "Noelle L",
    "role": "Student",
    "prop": "I can’t thank you enough for taking the time (several times lol) to help me! A big thanks to @robertpm for guiding/helping me get to where Im at, and pushing me not to give up"
  },
  {
    "date": "9/12/2019",
    "name": "Allie",
    "role": "Student",
    "prop": "Hey @robertpm, I just got back from the weekend and am finishing up on the project. I just wanted to thank you for how clearly you explained these bugs in my app. It’s so helpful to have another pair of eyes, especially when those eyes obviously have a talent for teaching "
  },
  {
    "date": "8/10/2019",
    "name": "Dylan B",
    "role": "Student",
    "prop": "Hey Robert, I just wanted to say thank you very much for sending that coding challenge my way. It really helped me out with figuring out what I was doing wrong. I had the click event handler not on the fieldset, I was looping over the wrong items, and instead of changing these I was constantly trying to fix the conditional in the if/else statement. So I can’t thank you enough for looking out for me, you are a true gentleman."
  },
  {
    "date": "7/31/2019",
    "name": "Chinyee",
    "role": "Student",
    "prop": "That was a very invaluable talk. Thank you @robertpm indeed, sometimes mindset and adtitude are \"the thing\" to bring us to success!"
  },
  {
    "date": "7/29/2019",
    "name": "Yvonne M",
    "role": "Student",
    "prop": "yeahhhhhhhh thank you so much ... @robertpm you are a superhero !!!!!!"
  },
  {
    "date": "7/17/2019",
    "name": "Thomas M",
    "role": "Student",
    "prop": "Thanks a lot @robertpm. Your the king!"
  },
  {
    "date": "7/2/2019",
    "name": "Nat",
    "role": "Student",
    "prop": "… you don’t know how relieved you just made me … I think I’ve been turning around what was wrong for So long I couldn’t even see it anymore, so kind of you, thank you for your time and attention you made my day"
  },
  {
    "date": "6/19/2019",
    "name": "Luc",
    "role": "Student",
    "prop": "I simply can't thank you enough my man @robertpm"
  },
  {
    "date": "6/18/2019",
    "name": "Indasia",
    "role": "Student",
    "prop": "@robertpm - you saved my life! once again! Lol. Thank youuuu!"
  },
  {
    "date": "5/21/2019",
    "name": "Douglas H",
    "role": "Student",
    "prop": "@robertpm You are my hero!!!"
  },
  {
    "date": "5/20/2019",
    "name": "sradms0",
    "role": "Teammate",
    "prop": "Thanks, man. Yeah, it was a rush, but it was good! As always, you handle things masterfully."
  },
  {
    "date": "5/7/2019",
    "name": "Luc",
    "role": "Student",
    "prop": "Robert, I don't know how but you always seem to have such an inspirational pep talk, you're a big inspiration and I'm very proud to be part of this team"
  },
  {
    "date": "4/30/2019",
    "name": "Bouke",
    "role": "Student",
    "prop": "Thanks Robert! You're my personal hero. I had a great day of coding today and was able to finish the project... almost."
  },
  {
    "date": "4/30/2019",
    "name": "nich",
    "role": "Teammate",
    "prop": "Hey, my wife reached out for help on slack yesterday and said you were the nicest, most encouraging voice. I said that's the Robert I know!"
  },
  {
    "date": "4/11/2019",
    "name": "YK",
    "role": "Student",
    "prop": "Hello Robert, I wanted to take a few moments, to say thank you,  thanks for the motivation and guidance that you provide, I am not talking, when we need help we turn to you for answers, it's about the positivity that you send weekly, to stay sharp and focuses on success and learning more and showing us tools to help to accomplish our goals. I really appreciate those topics and your initiative. Sincerely Thank Man!"
  },
  {
    "date": "2/12/2019 ",
    "name": "KJB",
    "role": "Student",
    "prop": "If I switch to the Front-End TD, does that mean I won't be able to talk to you anymore? *You* are the best thing about this TD"
  },
  {
    "date": "10/11/2018",
    "name": "Jennifer N",
    "role": "Teammate",
    "prop": "But right now, I want to give a shout out to @robertpm who is brilliant, eloquent, charming, infinitely encouraging, highly diplomatic, and unbelievably patient. Besides that, he's a great listener and just all-around good guy (which is rarer than one would hope). So thank you, Robert for... you know... being you "
  },
  {
    "date": "9/20/2018",
    "name": "Brian J",
    "role": "Teammate",
    "prop": "You definitely earned the title of \"Student Success Specialist *Guru*\" in my book! "
  },
  {
    "date": "9/20/2018",
    "name": "Luc",
    "role": "Student",
    "prop": "Haha these words are the reason why I got into this TD @robertpm always seem to impress"
  },
  {
    "date": "9/11/2018",
    "name": "aclark206",
    "role": "Student",
    "prop": "@robertpm I really appreciate your relentless positivity. You really set a beautifully supportive tone. Thank you!"
  },
  {
    "date": "9/11/2018",
    "name": "Angelo V",
    "role": "Student",
    "prop": "oh man, @robertpm thanks so much for sharing your words of encouragement with us. i especially needed to read it tonight."
  },
  {
    "date": "9/11/2018",
    "name": "Abbey M",
    "role": "Student",
    "prop": "Aw @robertpm! That was so beautiful!  I also needed that today. Thanks to all the great staff at Treehouse for helping us newbies realize a dream!"
  },
  {
    "date": "9/8/2018",
    "name": "Chris V",
    "role": "Student",
    "prop": "Hey Robert, I apologize for the late response. I wish you had a blog, I would love to read your story. Hopefully you'll be able to write a blog soon!"
  },
  {
    "date": "7/28/2018",
    "name": "Emma",
    "role": "Teammate",
    "prop": "@robertpm I love positivity you bring here!"
  },
  {
    "date": "7/12/2018",
    "name": "Ron",
    "role": "Student",
    "prop": "This is awesome, and Robert you are literally a highlight of this techdegree"
  },
  {
    "date": "7/11/2018 ",
    "name": "BrandonV",
    "role": "Student",
    "prop": "I want to take a second to thank you for your very thorough, an detailed feedback. I appreciate the time you took to run, view, and review my work, while giving me precise examples and how to carry out with the project's scope. As well giving me examples and options on how I could have proceeded with the project on the direction I was going. So once again thank you for the feedback, I appreciate your time in doing so. Thank you Robert. :+1:"
  },
  {
    "date": "7/1/2018",
    "name": "Skydev",
    "role": "Student",
    "prop": "Thanks @robertpm sir, for motivating us. You are really a great teacher, we need people like you here in India. You dont know how much people will love you here. We all love you"
  },
  {
    "date": "6/13/2018",
    "name": "debs_o",
    "role": "Teammate",
    "prop": "I think your brilliant @robertpm and thats all that matters"
  },
  {
    "date": "5/8/2018",
    "name": "Riaz K",
    "role": "Student",
    "prop": "I hope all is well @robertpm. I have to say when you come to the chat rooms it always makes me smile because you have a great attitude about yourself. As a student you are very welcoming and not intimidating to talk to."
  },
  {
    "date": "5/8/2018",
    "name": "Jason W",
    "role": "Teammate",
    "prop": "Robert Manolis was a bright guiding light through my Techdegree, and on top of the many insights he provided into technical details of some bit of code, he taught me so much about how attitude, perseverance, and positivity play into finding success as a developer"
  },
  {
    "date": "5/8/2018",
    "name": "Randy L",
    "role": "Teammate",
    "prop": "Also, in my journey I can't thank Robert Manolis enough for the hours he spent mentoring and encouraging me"
  },
  {
    "date": "5/8/2018",
    "name": "Doug H",
    "role": "Student",
    "prop": "As for mentoring, Robert Manolis was definitely the inspiration guru."
  },
  {
    "date": "5/8/2018",
    "name": "Debbie O",
    "role": "Teammate",
    "prop": "Robert Manolis whose encouraging posts made me jump out of bed eager to code. The amazing support and encouragement from Robert is what I needed and what got me to where I am today"
  },
  {
    "date": "4/26/2018",
    "name": "nich",
    "role": "Teammate",
    "prop": "I was watching you help Toby last night man. I just wanted to say you’re doing a great job, because I know people don’t say it enough."
  },
  {
    "date": "3/27/2018",
    "name": "Jennifer N",
    "role": "Teammate",
    "prop": "Hey! In case no one has told you this yet today:  you're amazing and I'd be willing to bet good money that your encouragement touches each and every person in here :slightly_smiling_face:  Just thought you should know that :yellow_heart:"
  },
  {
    "date": "3/15/2018",
    "name": "Viraj",
    "role": "Student",
    "prop": "Thanks @robertpm you are simply awesome. I've read your posts and they are very motivational. Thanks again for welcoming me to the slack."
  },
  {
    "date": "3/13/2018",
    "name": "kodie",
    "role": "Student",
    "prop": "wow @robertpm good job helping everyone out! hey robert, love your posts. do you have a blog where you post all the stuff you post here? that'd be awesome you always put up alot of great insights"
  },
  {
    "date": "3/3/2018",
    "name": "Zak1144",
    "role": "Student",
    "prop": "@robertpm maaaan thank you soo much feeling so much better already! going to save it and read it again on my way there ,on monday! best advice i have been given lately! love this forum"
  },
  {
    "date": "",
    "name": "Jason W",
    "role": "Teammate",
    "prop": "Hey, how are you? I just wanted to personally thank you for all the help and support you provided during the Techdegree. There were times when I questioned if I could do it and your encouragement made all the difference. You are awesome at what you do and all of these students are lucky to have you here. So sincerely, thank you."
  },
  {
    "date": "12/15/2017 ",
    "name": "Randy L",
    "role": "Teammate",
    "prop": "You’re like our very own Obi Won Kenobi."
  },
  {
    "date": "11/28/2017",
    "name": "ddulaney",
    "role": "Student",
    "prop": "Thank you for such a great letter I️ love your amazing positive attitude!"
  },
  {
    "date": "11/17/2017",
    "name": "Brian J",
    "role": "Teammate",
    "prop": "Thanks brother! It’s always so awesome talking to you!"
  },
  {
    "date": "10/31/2017 ",
    "name": "Jason W",
    "role": "Teammate",
    "prop": "Seriously, man, thanks so much. Your constant motivation, guidance, and direction have made more of a difference in my life than I could ever say."
  },
  {
    "date": "10/25/2017",
    "name": "debs_o",
    "role": "Teammate",
    "prop": "@robertpm Thanks Robert. I love waking up to your words of encouragement it makes me want to just go straight to the computer :joy:"
  },
  {
    "date": "9/27/2017",
    "name": "mlembke1",
    "role": "Student",
    "prop": "I am super thankful for you, Robert! You're like a wise uncle who gives me advice! :joy: I'll be sure to let you guys know how it goes. All the best!"
  },
  {
    "date": "7/27/2017",
    "name": "ggbemou",
    "role": "Student",
    "prop": "thanks , you don't have any ideas how you are making people feel ,big thanks. you are changing the world by really being patience with us"
  }
]